# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 1  # number of classes
kpt_shape: [16, 3]  # number of keypoints, number of dims (2 for x,y or 3 for x,y,visible)
scales: # model compound scaling constants, i.e. 'model=yolov8n-pose.yaml' will call yolov8-pose.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]
fusion_mode: bifpn
# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, EfficientViT_M1, []]  # 4
  - [-1, 1, SPPF, [1024, 5]]
#  - [-1, 1, BiLevelRoutingAttention_nchw, [8, 7]]
  - [-1, 1, SegNext_Attention, []] # 10
 # - [-1, 1, FocalModulation, []]  # 5

# YOLOv8.0n head
head:
  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f_GhostDynamicConv, [512]]  # 12

  - [-1, 1, DySample, [2, 'lp']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f_RVB_EMA, [256]]  # 15 (P3/8-small)
#  - [-1, 1, BiLevelRoutingAttention_nchw, [8, 7]]

  - [-1, 1, ADown, [256]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f_GhostDynamicConv, [512]]  # 18 (P4/16-medium)

  - [-1, 1, ADown, [512]]
  - [[-1, 6], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f_GhostDynamicConv, [1024]]  # 21 (P5/32-large)
#  - [-1, 1, MLCA, []]

  - [[12, 15, 18], 1, Pose, [nc, kpt_shape]]  # Detect(P3, P4, P5)
